//
//  1309.swift
//  동물원_2차원배열ver
//
//  Created by SeokHyun on 2023/08/14.
//

let n = Int(readLine()!)!
var d = Array(repeating: Array(repeating: 0, count: 3), count: n+1)
let mod = 9901
d[0][0] = 1 // 초기값 설정

for i in 1..<n+1 {
  d[i][0] = (d[i-1][0] + d[i-1][1] + d[i-1][2]) % mod
  d[i][1] = (d[i-1][2] + d[i-1][0]) % mod
  d[i][2] = (d[i-1][1] + d[i-1][0]) % mod
}

print((d[n][0] + d[n][1] + d[n][2]) % mod)

// d[n][0] 의미: n번줄에 아무것도 추가하지 않는 경우
// d[n][1] 의미: n번줄에 왼쪽에만 추가하는 경우
// d[n][2] 의미: n번줄에 오른쪽에만 추가하는 경우

// d[n][0] = d[n-1][0] + d[n-1][1] + d[n-1][2] 오른쪽만 추가하거나 왼쪽만 추가하거나 아무것도 추가하지 않음
// d[n][1] = d[n-1][2] + d[n-1][0] 오른쪽만 추가하거나 아무것도 추가하지 않음
// d[n][2] = d[n-1][1] + d[n-1][0] 왼쪽에만 추가하거나 아무것도 추가하지 않음
